first_data = [['принтер', 7100, 1], ['компьютер', 75000, 1], ['принтер', 3500, 8], ['клавиатура', 950, 15], ['веб-камера', 920, 8],
['монитор', 30000, 9], ['сканер', 7900, 15], ['веб-камера', 810, 9], ['компьютер', 57000, 5], ['компьютер', 46000, 1],
['мышь', 870, 1], ['монитор', 56000, 5], ['монитор', 47000, 3], ['сканер', 7800, 5], ['мышь', 730, 4], ['принтер', 43000, 10],
['клавиатура', 600, 2], ['сканер', 8400, 5], ['монитор', 74000, 3], ['принтер', 59000, 8], ['принтер', 30000, 15], ['клавиатура', 1200, 10], ['клавиатура', 1400, 4], ['компьютер', 75000, 8], ['принтер', 96000, 9],]

total_value = 0
total_count = 0
total_hardware = []

for hardware, value, count in first_data:
    total_value += value
    total_count += count
    if hardware not in total_hardware:
        total_hardware.append(hardware)


print(f"Полное количество товаров на складе: {total_count}\nПолная сумма товаров на складе: {total_value}\nНаименование всех товаров на складе: {total_hardware}")














# print('Количество: ' + str(amount) + '. ' + 'Общая стоимость: ' + str(price) + '. ' + 'Устройство: ' + str(hardware) + '.')
# Нужно применять цикл for(наверное) + распаковку контейнеров, поиграться с этим завтра